#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код






































































































































































































print ("ГЛАВА 1 : ПРОЛОГ");

print ("утром вы просыпаетесь");

print ("в полном одиночестве.");

print ("вы поняли, что по какой-то причине весь город опустел.");

print ("Вы обрадовались этому, ходите по магазинам, берёте что хотите, веселитесь.");

print ("Придя домой, вы решаете посмотреть телевизор.");

print ("Телеведущий новостей говорит, что в вашем городе внезапная вспышка смертельного и неизлечимого пока что вируса. По исследованиям учёных, вирус сводит людей с ума и превращает в некое подобие зомби. ");

print ("Все здоровые люди эвакуированы, но по какой-то причине вас забыли.");

print ("Теперь вы закрыты в пустом городе - один на один с вирусом и опасностями.");

print ("ГЛАВА 2 : ЭТО НЕ ЖИЗНЬ, А ПОПЫТКИ ВЫЖИТЬ!");

print ("вы поняли, что вам будет не просто выжить, но вы не сдаетесь");

print ("вы из семьи, которая никогда не сдается");

print ("вы нашли в своей квартире сковороду");

print ("взять? да(1)/нет(2)");

A = int(input())

if A == 1:
    print ("это был хороший выбор, таким конечно не убьешь, но хотя-бы защититься ты можешь");
    print ("увидев у телеведущего воду, вам захотелось пить");
    print ("пойти за припасами? да(1)/нет(2)");
    A = int(input())
    if A == 1:
        print ("вы пошли за припасами");
        print ("процесс...");
        print ("ошарашить прохожего монстра? да(1)/нет(2)");
        A = int(input())
        if A == 1:
            print ("вы решили убить этого монстра, но он оказался сильнее и оставил вас без сознания");
            print ("продолжение следует...");
        if A == 2:
            print ("вы прошли мимо, типа не заметили врага");
            print ("он не понял мира и убил вас со спины"); 
            print ("ИГРА ОКОНЧЕНА");     
    if A == 2:
        print ("вы решили, что там опасно и не пошли за водой");
        print ("вы умерли от недостатка пищи и влаги"); 
        print ("ИГРА ОКОНЧЕНА");

if A == 2:
    print ("вы безоружны, и никому не сможете хорошенько-так навалять");
    print ("ИГРА ОКОНЧЕНА");







