#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код
#запускай проект, а не смотри в код





































































































































































































import time
print ("ГЛАВА 1 : ПРОЛОГ");
time.sleep(0.5)
print ("утром вы просыпаетесь");
time.sleep(0.5)
print ("в полном одиночестве.");
time.sleep(0.5)
print ("вы поняли, что по какой-то причине весь город опустел.");
time.sleep(0.5)
print ("Вы обрадовались этому, ходите по магазинам, берёте что хотите, веселитесь.");
time.sleep(0.5)
print ("Придя домой, вы решаете посмотреть телевизор.");
time.sleep(0.5)
print ("Телеведущий новостей говорит, что в вашем городе внезапная вспышка смертельного и неизлечимого пока что вируса. По исследованиям учёных, вирус сводит людей с ума и превращает в некое подобие зомби. ");
time.sleep(0.5)
print ("Все здоровые люди эвакуированы, но по какой-то причине вас забыли.");
time.sleep(0.5)
print ("Теперь вы закрыты в пустом городе - один на один с вирусом и опасностями.");
time.sleep(0.5)
print ("ГЛАВА 2 : ЭТО НЕ ЖИЗНЬ, А ПОПЫТКИ ВЫЖИТЬ!");
time.sleep(0.5)
print ("вы поняли, что вам будет не просто выжить, но вы не сдаетесь");
time.sleep(0.5)
print ("вы из семьи, которая никогда не сдается");
time.sleep(0.5)
print ("вы нашли в своей квартире сковороду");
time.sleep(0.5)
print ("взять? да(1)/нет(2)");

A = int(input())

if A == 1:
    print ("это был хороший выбор, таким конечно не убьешь, но хотя-бы защититься ты можешь");
    time.sleep(0.5)
    print ("увидев у телеведущего воду, вам захотелось пить");
    time.sleep(0.5)
    print ("пойти за припасами? да(1)/нет(2)");
    A = int(input())
    if A == 1:
        print ("вы пошли за припасами");
        time.sleep(0.5)
        print ("процесс...");
        time.sleep(2)
        print ("ошарашить прохожего монстра? да(1)/нет(2)");
        A = int(input())
        if A == 1:
            print ("вы решили убить этого монстра, но он оказался сильнее и оставил вас без сознания");
            time.sleep(0.5)
            print ("продолжение следует...");
        if A == 2:
            print ("вы прошли мимо, типа не заметили врага");
            time.sleep(0.5)
            print ("он не понял мира и убил вас со спины"); 
            time.sleep(0.5)
            print ("ИГРА ОКОНЧЕНА");     
    if A == 2:
        print ("вы решили, что там опасно и не пошли за водой");
        time.sleep(0.5)
        print ("вы умерли от недостатка пищи и влаги"); 
        time.sleep(0.5)
        print ("ИГРА ОКОНЧЕНА");

if A == 2:
    print ("вы безоружны, и никому не сможете хорошенько-так навалять");
    time.sleep(0.5)
    print ("ИГРА ОКОНЧЕНА");







